'''定义各种故障类型'''

#数据异常类型
X = {'X1': '数据中断(瞬时)', 'X2': '数据中断(长期)', 'X3': '数据重复', 'X4': '数据固定偏移',
     'X5': '数据为零', 'X6': '数据连续增长(降低)', 'X7': '数据跳变', 'X8': '数据抖动', 'X9': '离群点'}
#故障类型
S = {'S1_0.0': '软件故障', 'S2_0.0': '通信中断', 'S3_0.0': '电源故障', 'S4_0.0': '传感器异常',
     'S5_0.0': '外部环境', 'S6_0.0': '装置本体故障', 'S7_0.0': '设备状态变化', 'S8_0.0': '恶劣工况',
     'S9_0.0': '环境干扰', 'S10_0.0': '软件缺陷', 'S11_0.0': '参数错误', 'S12_0.0': '通信质量差',
     'S13_0.0': '模块损坏等', 'S14_0.0': '完全失效', 'S15_0.0': '固定偏移', 'S16_0.0': '灵敏度下降',
     'S17_0.0': '漂移'}
